<a href="https://colab.research.google.com/github/JakeOh/202007_itw_bd18/blob/master/lab_python/python44_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [7]:
# seaborn 패키지의 샘플 중에서 titanic 데이터 프레임을 로드.
titanic = sns.load_dataset('titanic')
print(titanic.shape)

(891, 15)

In [8]:
# 첫 5개 행(row) 출력
titanic.iloc[:5]

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [9]:
# 마지막 5개 행 출력
titanic.iloc[-5:]

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[5 rows x 15 columns]

titanic 데이터 프레임 변수들(컬럼들)
*   survived: 생존 여부(0: 사망, 1: 생존)
*   pclass: 객실 등급
*   sex: 성별
*   age: 나이
*   sibsp: 동승한 형제자매, 배우자 숫자
*   parch: 동승한 부모, 자식 숫자
*   fare: 티켓 가격(운임)
*   embarked: 정박 항구

In [10]:
# 생존자, 사망자 숫자

In [11]:
# 남성 생존자, 여성 생존자 숫자, 비율
#   생존자들 중에서 남성/여성 숫자
#   생존자들 중에서 남성/여성 비율

In [ ]:
# 남성 승객 중 생존자 비율
# 여성 승객 중 생존자 비율

In [ ]:
# 객실 등급(pclass)별 생존자 숫자, 비율
#   생존자들 중에서 각 객실 등급별 승객 숫자
#   생존자들 중에서 각 객실 등급별 승객 비율

In [ ]:
# 1등급 객실 승객 중 생존자 비율
# 2등급 객실 승객 중 생존자 비율
# 3등급 객실 승객 중 생존자 비율

In [ ]:
# 10대 생존자 숫자, 비율
#   생존자들 중에서 10대의 숫자
#   10대 승객들(생존 or 사망) 중에서 생존자의 비율